dudasdavid/Operation-Sonnenwende-22/software/gun_STM32F411/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
static void process_half(size_t offset, size_t count);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TOF_TX_Pin GPIO_PIN_2
#define TOF_TX_GPIO_Port GPIOA
#define TOF_RX_Pin GPIO_PIN_3
#define TOF_RX_GPIO_Port GPIOA
#define SPI1_CS_Pin GPIO_PIN_4
#define SPI1_CS_GPIO_Port GPIOA
#define SPI1_DC_Pin GPIO_PIN_0
#define SPI1_DC_GPIO_Port GPIOB
#define SPI1_RST_Pin GPIO_PIN_1
#define SPI1_RST_GPIO_Port GPIOB
#define FLYWHEEL_CH1_Pin GPIO_PIN_8
#define FLYWHEEL_CH1_GPIO_Port GPIOA
#define FLYWHEEL_CH2_Pin GPIO_PIN_9
#define FLYWHEEL_CH2_GPIO_Port GPIOA
#define PUSHER_CH3_Pin GPIO_PIN_10
#define PUSHER_CH3_GPIO_Port GPIOA
#define PUSHER_CH4_Pin GPIO_PIN_11
#define PUSHER_CH4_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
